---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupportVerticalOffset
source: html/1c423c8e-8ced-95d5-0eff-642ca65f8038.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupportVerticalOffset Property

"Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupportVerticalOffset { get; }
```